[
    {
        "title": "Project Completion and Final Reflections",
        "date": "June 10, 2025",
        "content": "As we reach the final week of our drone detection project, our focus has shifted towards preparing comprehensive presentation materials and conducting final system validation. The complete prototype has been successfully assembled and fabricated through precision metalwork and cutting processes...",
        "image": "/public/images/post_14.jpg",
        "link": "/public/posts/post_14.html"
    },
    {
        "title": "Meeting at E.M.F.A.",
        "date": "June 4, 2025",
        "content": "This Wednesday, June 4th, we held a very productive meeting at E.M.F.A.'s facilities, attended by Lieutenant Colonel João Boita and Major Francisco Machado. The main goal of the meeting was to delve into various aspects of our project, from its current development to future growth prospects...",
        "image": "/public/images/post_13.jpg",
        "link": "/public/posts/post_13.html"
    },
    {
        "title": "System Integration Complete - Drone Detection Now Fully Operational",
        "date": "May 25, 2025",
        "content": "This week marked a significant milestone in our drone detection project as we completed the final tweaks to the rotor movement system and achieved full system integration. We finalized the precise calibration of our rotor movement mechanisms, ensuring optimal positioning and tracking...",
        "image": "/public/images/post_12.jpg",
        "link": "/public/posts/post_12.html"
    },
    {
        "title": "Improving Camera Movement and Tracking Stability",
        "date": "May 18, 2025",
        "content": "This week, we continued refining our prototype to ensure that the movement of the servo motors — which control the camera’s orientation — becomes more stable and less shaky during operation...",
        "image": "/public/images/post_11.gif",
        "link": "/public/posts/post_11.html"
    },
    {
        "title": "First Prototype Assembly and Initial Tests",
        "date": "May 11, 2025",
        "content": "This week marked a significant milestone in our project: we assembled the full prototype and carried out the first real-world tests of our system...",
        "image": "/public/images/post_10.jpeg",
        "link": "/public/posts/post_10.html"
    },
    {
        "title": "Final Components Acquired – Assembly Phase Begins",
        "date": "May 4, 2025",
        "content": "We have successfully acquired all the components required for our final prototype. The next step is to assemble and test everything to verify that our system performs as expected...",
        "image": "/public/images/post_9.jpg",
        "link": "/public/posts/post_9.html"
    },
    {
        "title": "Rotor Control Testing and Hardware Adjustments",
        "date": "April 27, 2025",
        "content": "This week, we developed the first version of the code responsible for rotating the rotors based on the image data. Initial tests were promising — the rotors are responding correctly and rotating as expected. The next step is to integrate the camera and test the system with real-world footage to ensure everything works in practice...",
        "image": "/public/images/post_8.jpg",
        "link": "/public/posts/post_8.html"
    },
    {
        "title": "Progress and Upcoming Steps",
        "date": "March 29, 2025",
        "content": "This week, progress on our project has been a bit slower due to the deadlines for major assignments from other courses. However, we received good news — we can now pick up the remaining components, specifically the Raspberry Pi 5 and the 64GB memory card...",
        "image": "/public/images/post_7.jpg",
        "link": "/public/posts/post_7.html"
    },
    {
        "title": "Training Progress and Confidence in Our Model",
        "date": "March 22, 2025",
        "content": "This week, we continued training our machine learning model, leaving a computer running for 24 hours to ensure continuous training. We're now confident that the model is capable of accurately detecting drones and distinguishing them from other objects...",
        "image": "/public/images/post_6.jpeg",
        "link": "/public/posts/post_6.html"
    },
    {
        "title": "Progress on Our Anti-Drone Detection System",
        "date": "March 15, 2025",
        "content": "This week, we made significant progress in training our machine learning model. We've been refining the algorithm, focusing on improving its accuracy in distinguishing between drones and other objects like birds. Each iteration brings us closer to a reliable and efficient detection system...",
        "image": "/public/images/post_5.jpg",
        "link": "/public/posts/post_5.html"
    },
    {
        "title": "Progress Update: Improving Machine Learning and Industry Insights",
        "date": "March 8, 2025",
        "content": "This week marked significant progress in our project, particularly in two key areas: the enhancement of our machine learning model and insightful discussions with industry experts...",
        "image": "/public/images/post_4.jpg",
        "link": "/public/posts/post_4.html"
    },
    {
        "title": "Progress Update: Training the Model and Finalizing Components",
        "date": "March 1, 2025",
        "content": "This week, we began training the machine learning algorithm that will power our drone detection system: YOLO v11. So far, we have trained the model with approximately 10,000 images, but there is still a long way to go in terms of refining and improving its accuracy. The process of fine-tuning the model will continue as we aim to optimize its performance for real-world detection scenarios...",
        "image": "/public/images/post_3.jpg",
        "link": "/public/posts/post_3.html"
    },
    {
        "title": "Finalizing Our Project Proposal: Focusing on Detection and AI-Driven Solutions",
        "date": "February 21, 2025",
        "content": "As we moved forward with our project, one of the most crucial stages was finalizing our Project Proposal and defining the exact direction we would take. After considering several different approaches and discussing our options with industry experts, we were able to narrow down our focus and make the key decision on how we would structure our system...",
        "image": "/public/images/post_2.png",
        "link": "/public/posts/post_2.html"
    },
    {
        "title": "Shaping Our Anti-Drone Detection System: From Concept to Implementation",
        "date": "February 14, 2025",
        "content": "As we set out to develop our anti-drone detection and jamming system, one of the first challenges we faced was defining the most effective approach for implementation. With numerous technologies available and various detection methodologies to consider, we dedicated significant time to research and discussion before settling on a concrete plan...",
        "image": "/public/images/post_1.jpg",
        "link": "/public/posts/post_1.html"
    }
]
